---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRail.HostRailingId
source: html/39f8e3c5-543d-f490-b9a4-1407c21292b6.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail.HostRailingId Property

The id of the host Railing that contains this rail.

## Syntax (C#)
```csharp
public ElementId HostRailingId { get; }
```